Revit 2026 API

# BeamSystemJustifyType Enumeration

---

Describes the justify method of beamsystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BeamSystemJustifyType
```
```vb
Public Enumeration BeamSystemJustifyType
```
```cpp
public enum class BeamSystemJustifyType
```
```fsharp
type BeamSystemJustifyType
```

| Member name | Value | Description |
| --- | --- | --- |
| Beginning | 3 | Beginning. |
| Center | 1 | Center. |
| DirectionLine | 4 | DirectionLine. |
| End | 2 | End. |

#### Reference

Autodesk.Revit.DB Namespace